---

C#Visual BasicVisual C++

Revit 2024 API
---
MEPCurveType..::..Tap Property
MEPCurveType Class See Also Send Feedback
---

The default tap fitting of the MEP curve type.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)

# Syntax

C#
---

    public FamilySymbol Tap { get; set; }

Visual Basic
---

    Public Property Tap As FamilySymbol
    	Get
    	Set

Visual C++
---

    public:
    property FamilySymbol^ Tap {
    	FamilySymbol^ get ();
    	void set (FamilySymbol^ value);
    }

# Remarks

This property is used to retrieve the default tap fitting of the MEP curve type, and can be nullNothingnullptra null reference (Nothing in Visual Basic) if there is no default value. Use RoutingPreferenceManager to set this property for PipeType MEPCurves.

# See Also

MEPCurveType Class

Autodesk.Revit.DB Namespace